Tekla Open API Reference for Tekla Structures 2025
LoadGroup.Incompatible Property
 This variable is used to store information on which groups exclude each other in structural analysis load combination. Load combination is a process in which some simultaneously acting load groups are multiplied by their partial safety factors and combined with each other according to specific rules. To accurately combine loads which have the same load group type, you need to identify which load groups exclude each other, i.e. are incompatible. This variable stores one integer, and all groups who have this same integer are known to be incompatible with each other.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Incompatible { get; set; }
Public Property Incompatible As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace